{"podcast_details": {"podcast_title": "With One Tied Hand - The Buffalo Soldiers of World War II", "episode_title": "Ivan Reads Flavio's Letter - Q&A", "episode_image": "https://media.rss.com/pacificfilmfoundation/20200321_183609_a4b91ecf79b458b5de0b34ac9fb216b6.jpeg", "episode_transcript": " And I really didn't quite understand how the Italians felt. You know, and then I was given a letter from one of the reenactors, a guy called Flavio, just before I returned home. I read it when I returned home and I began to understand their feelings. Now, this is the letter and I'll just end with this because, and it is written, he wrote it, it's been translated into English with sort of an Italian vent. So some of the words are not quite put together quite the right way. And I can get a little emotional when I read parts of this letter. So you might have to excuse me on that. But he says, to Mr. Ivan J. Houston, with immense pleasure, Mr. Ivan, I felt to write a few lines to prove the immense love and eternal gratitude that I have towards the American people and especially the Buffalo Soldiers. He said, I am 45 and have not experienced the tragedies and horrors of the greatest tragedy of humanity. If, however, I am a free man and many others like me, I can only thank you, U.S. Soldiers. We have been freed from oppressor by the sacrifice of so many guys fighting on every front from the Atlantic to the Pacific on the sea, in the air, on the ground. Since my, no, my father, since I was a child, always told me that you, and this is in quotes, MORI, M-O-R-I, and in parentheses, MORI is the name used to describe black warriors coming from Africa since the Middle Age, offered him the first chocolate long time ago in September 1944. On my mind, I have always thought you as the good giants, in fact, my heroes. He said, by profession, I am a traitor. In my spare time, I'm a reenactor. He said, so it is with immense pleasure that I write you, and in my life, I'll be able to tell of having met one of the good giants, my heroes. I wish you my best greetings of welcome, wishing you a great stay, saying thank you from the deep of my heart. That's what I finally found out was behind all of these greetings that I received when I was in Italy. I asked my hostess, Mattea, whom I have written back and forth, and she and I are translating my book into Italian. The University of Pisa is doing it, and so we're into that. And I said, well, why did they do it? And she just said, because they love you. Thank you. Yeah, questions, yeah. Yes, I have a question. I was reading something about Dwight Eisenhower when he was general in Europe, and I do not know this. And it said that he was trying to make the situation for black soldiers better. Did any of you know that? Did you know that there were changes being made that certain people were trying to do things, and in particular Dwight Eisenhower? We knew that they were, you see, in the infantry, they were losing a lot of men. Most, there were a million black soldiers in the army. Only maybe 30,000 of us were in combat units. The others were in quartermaster driving trucks. They were laborers unloading ships. They were building airfields. They needed people to volunteer for the infantry because we were losing men. And I believe he was involved in trying to get black troops to move into, to go into the infantry. But that was very late in the war, and it was caused by high casualties. I don't think it was, you know, it did not become army policy until President Truman in 1948 integrated the armed forces. The little man from Missouri who nobody really liked at that time, yet he said the armed forces will be integrated. And they had to do it because they had to obey orders. General Almond was opposed to that. Most of the higher officers were opposed. And yet it came about because of President Truman. And that fundamentally is why we were, why we, you know, got the armed forces integrated at a very early date. Any other questions? Yes. Were you all enlisted men or were there some officers among the blacks? Oh, okay, no. I was an enlisted man, but in the, in our division, there were, all of the medics were black, and they were officers. All of the chaplains were black, and they were officers. All of the officers from major and above that were what we call line officers were white. The, some of the captains, when we went overseas, captains, most of our, all of our company commanders who were supposed to be captain were lieutenant, first lieutenants, the black ones. When we got overseas, after about a month in combat, they all became captains. So captains and lieutenant, there were some white lieutenants, but under army policy, no black officer could command a white soldier. So this was, so you never could bring a white lieutenant under a black captain. This was army policy, and you know, in combat, you're losing people. So you're, you know, this is crazy, but that's the way it was. Could you describe your medals? Oh, okay. Yeah, here they are. This is the bronze star. This is for heroic achievement in action. Purple heart. I got wounded on April the 9th, 1945. I never will forget. We had crossed this canal, the Cinquale Canal, and we entered a villa, a lot of villas in that part of Italy. Thank goodness, because they were all strong, and shells didn't usually go through them. And anyway, we entered a villa. We just captured it. I went out the front door to take a look, turned to go back in. A German shell hit and blew me through the front door. A piece of shrapnel ended up sticking in my shoulder. My back was stinging. I was on the floor. So anyway, I wasn't far from the medic, so I took myself to the medic. They took off my jacket and shirt, sprinkled sulfur on my wound, wrapped it up, and sent me back to combat. So this is the good conduct medal. This is in, well, if you're OK, if you don't have too many black marks against you, you get the good conduct medal. And this is the European African Middle Eastern Campaign Medal with three bronze battle stars. My unit was in three campaigns. The battles from Rome to the Arno River was won. The battle of the North Apidine Mountains, and the final battle was the battle of the Po Valley, which was in northern Italy. So those are the medals. And this is the combat infantryman's badge, which I received because I took ammunition, tried to get ammunition on top of this mountain. And we never did make it, but that's for what they call exemplary conduct in action against the enemy. Those are the medals. Any other questions? Well, I certainly want to thank you. First time I've made me a group of ladies and didn't know how it would come off because, you know, but talking about combat and military. But please believe me, you know, if you have a chance, visit Italy. It's you know, it's a wonderful country. And the people over there really love us. I mean, not only do they love the black soldiers, but they love all of us. Yes, I have a question. First of all, I would like to thank you for your service. Oh, thank you. Thank you very much."}, "podcast_summary": "The key insight from the letter from the Italian reenactor is the immense love and gratitude towards the American people and the Buffalo Soldiers for their contribution to freeing Italy from oppression during World War II. The author of the letter, Flavio, expresses admiration and hero worship towards the Buffalo Soldiers, whom he refers to as the \"good giants.\" This highlights the deep impact that the Buffalo Soldiers had on the Italian population and their perception as heroes. The guest also mentions President Truman's role in integrating the armed forces, which happened in 1948, and the limited opportunities for black soldiers to become officers at that time. In terms of the guest's own military experience, he shares about receiving medals for heroic achievement, being wounded in combat, and his unit's participation in three campaigns. The guest concludes by expressing gratitude for the opportunity to talk to the group and encourages them to visit Italy, where the people have a deep appreciation for all American soldiers.", "podcast_guest": ["Flavio, re de' Longobardi (\"Flavio, King of the Lombards\", HWV 16) is an opera seria in three acts by George Frideric Handel. The Italian-language libretto was by Nicola Francesco Haym, after Matteo Noris's Flavio Cuniberto. It was Handel's fourth full-length opera for the Royal Academy of Music. Handel had originally entitled the opera after the character of Emilia in the opera.Flavio is unusually concise for an opera by Handel of this period. It is also notable as a skillful blend of tragedy and comedy, both in the text and the music, and for being one of Handel's few operas to feature leading roles for all major voice categories of his day – soprano, contralto, castrato, tenor and bass.", "Flavio", ""], "podcast_highlights": "Podcast highlights:\n\n- The speaker received a letter from a reenactor in Italy, expressing immense love and gratitude towards the American people and the Buffalo Soldiers (0:00-1:26)\n- The reenactor describes the soldiers as \"good giants\" and heroes (1:27-2:20)\n- The speaker's hostess explains that the Italians love the soldiers because of their sacrifice and the freedom they brought (2:21-2:55)\n- The speaker asks about Dwight Eisenhower's efforts to improve the situation for black soldiers and mentions that there were changes being made, but integration didn't occur until 1948 (3:07-4:00)\n- The speaker describes the rank and race dynamics within their division, with black officers serving as medics and chaplains, and white officers holding higher ranks (4:01-5:08)\n- The speaker displays their medals, including the Bronze Star, Purple Heart, Good Conduct Medal, European African Middle Eastern Campaign Medal, and Combat Infantryman's Badge (5:24-6:44)\n- The speaker expresses gratitude for the opportunity to speak to the group and encourages visiting Italy, as the people there love all soldiers (6:47-8:00)"}