{"podcast_details": {"podcast_title": "Blind Plea", "episode_title": "Life On The Outside", "episode_image": "https://www.omnycontent.com/d/programs/796469f9-ea34-46a2-8776-ad0f015d6beb/8ad64298-75b7-4943-bb51-aff101097fa5/image.jpg?t=1682611865&size=Large", "episode_transcript": " Craving more content from Lemonada Media? Subscribe to Lemonada Premium today and unlock access to exciting bonus content, not only from us, but from all the shows across the network. You'll hear exclusive audio that continues to highlight all the ways we can make life suck less. You'd also be helping Lemonada bring you more of your favorite content for just $4.99 a month. Check out a free trial of Lemonada Premium today in the Apple Podcasts app by clicking on our podcast logo and then the subscribe button. Hey everyone, are you ready to add a sprinkle of joy to your day? Then you need to check out Add to Cart. Hi, I'm Sujant Pak. And I'm Kulapvi Laisak. We're your hosts and on this show, we talk about the things we buy, the things we buy into and what it says about who we are. That's right. Each week, we're going to have some honest and maybe, you know, little TMI conversations about all the fabulous, weird, wonderful things we're adding to or ditching from our carts. You know, we talk about beauty products, latest health trends, philosophies we're passionate about. Nothing is off limits on this podcast. We're diving deep into everything we and our guests buy into and exploring what it reveals about who we truly are. We're going to decide what's worth the investment, be it money or emotions. Add to Cart from Lemonada Media has new episodes out on Tuesdays wherever you get your podcasts. This is Blind Plea. I'm your host, Liz Flock. Devin was released from prison on May 23rd, 2023. She's back in Baltimore now living with her family. And so I gave her a call in early June, less than a month after her release, to talk about how things were going. She told me how hard she's been working to get her life back on track. The reality is it's not easy. Readjusting has been exhausting. There are a million things to get set up after you leave prison, from getting new IDs to trying to find work. Devin's been applying for lots of jobs. She wants to be fully independent as soon as she can. She's also set up a GoFundMe account to help her get back on her feet. Her goal is to secure a job, get an apartment, put a down payment on a car and start paying for therapy and her daughter's schooling. Basically rebuild her life. But I'll let Devin tell you more. Here is an edited version of our conversation. Oh my God, hi. Hi. It's nice to see you. It's nice to see you. How are you feeling? I'm okay. I'm so, I'll show you my bump really quick. I am pregnant. It does actually doesn't look like that much from there, but it feels like, I feel like a house. Yeah. Yeah, that's going to happen. Definitely. Yeah. How are you feeling? How's today been? It was all right. You know, my stepmom brought me to Pennsylvania. We went to the Dutch market and she took me to like the Walmart and stuff like that up there because it's nicer. But yeah, I mean, most days I'm just sitting around waiting for my mother to come home. That makes sense. I was trying to imagine like you on your first night home. How was it? Because like, I remember I talked to you and you got on that flight after they like dramatically cut off your ankle monitor and then you like, how was it being on the plane and then getting off and seeing everyone? Like what was that like? It's kind of weird because like I kind of just, I didn't let it like shock me. I kind of just was like, okay, this is what I have to do. Like I have to get on this plane. I have to take this trip. Then I have to get off and I have to find these, you know, I have to, you know, just get back to life. Like I still haven't processed anything. I still haven't processed anything because I have to just get back to life. Like I just feel like right now I don't have time to do that, you know, which I know isn't healthy but I can't really do anything else about it because I have to get, you know, more adjusted to life, more just to my parents. Like I don't really have time for me and I'm just trying to become independent. That's really like my, that's the only thing because once I'm independent, once I can completely rely on myself, then I don't need anybody. And that's been like what I had in my mind even before I left prison. Like I kept thinking to myself, okay, well, this is what I need to do when I leave. This is what I need to do. Like I think that that's what's keeping me from processing is like my drive that I have for myself that I need to do these things in order to have the things that I want into like, you know, so I can finally be like, okay, well, yeah, I went through this thing and I did this thing and I had to sit down for a while, but I'm okay. And look at me now, like I'm not broken or anything. I'm just, I just hurt a little bit, but I'm not broken. Yeah. What do you feel like you would want people to know about like reentry after being in prison or jail? It's more or less like reentry for me personally, reentry is all about yourself. And sometimes you have to be a little selfish when it comes to that because especially if you have kids, because you have to look at the bigger picture for me. It's like I have to get right and I have to do things for myself. And I think mental health is a big deal too. Like I'm getting Medicaid just so I could go see a mental health doctor. Basically that's my main focus. Because there's things out here in the world that you don't have to deal with in there. And so my biggest thing is like, you get as much as you put into it, you have to want it and you have to help yourself and you can't have too much pride or even shame really. You have to just do what you have to do. Find something, make it your motivation and hold on to it because that's what you need. You need motivation. Yeah. So you mentioned like Medicaid, like what are the, all the things, like can you list off like all the things you had to do when you got out? Like just driver's license, you know, whatever. I was, I, I've been gone for so long. So everything, I had to start over with everything. And so I had to file for my social security card, which I did online. I'm waiting on my birth certificate, which Sheila said she found a copy, but I don't know if she's mailed it out yet. That's another thing. Driver's license and then getting Medicaid, it's just paperwork. Everything's online now, but they just ask you a bunch of questions. And then I filed for food stamps because I don't have any income and I want to help my parents out because they've been spending a lot of money on her food and stuff like that. And so I want to be able to help them, you know, give back what they've given her. And then just like getting like an ID, like I have to get an ID, you know, I've been waiting on, you know, they, they need your, they need a other identification card. So I have to go soon because my prison one from Tutwiler expires soon. And then you need your social security and then you need two proofs of residency. And that's why I said you have to find like a motivation. You have to find a like a reason because and you have to want to do it because a lot of this stuff can be discouraging because it's just, you feel like it's just so much. And I was talking to my friend Nisha, she, she was at ATF with me. She was at the annex with me. She was telling me, she's like, even though we've only been out for a couple of weeks, it feels like we've been out for a year. I'm like, I know, like, I feel like I've been out for a long time. I feel like I have done nothing. And she was, we were talking about that. So like, that's an anxiety for, I'm sure not just for the both of us. I'm sure that's an anxiety for a lot of people who want to prove that they can do it. And you just get out and you're like, I haven't, I don't have this and I don't have that. It's been, it's, it's been like almost, and they're like, Devin, like I've had, you know, people tell me like, it's only been two weeks. Like my, Simone's had to tell me Devin, like, it's only been like two weeks. You've only been out. So you have to like give yourself a break. You need to chill out. And I'm like, but it's not fast enough. It's not working. It's not, I need a job. I need this. I need that. And it's like, just chill. Anyone else hoping to squeeze in one last getaway this summer? And does anyone else get worried about leaving their house or apartment unattended for so long? Before you leave, protect your home with Simply Safe Home Security 24 seven live guard protection. Now if an intruder breaks into your home, Simply Safe professional monitoring agents can actually see, speak to, and deter them through the new smart alarm wireless indoor camera, warning them that police are on their way. My Simply Safe system was installed incredibly quickly. And I feel so much better knowing that I have a system ready to go if I want to leave home for any longer stretches of time. Plus, the level of customer service has been unparalleled. 24 seven live guard protection is made possible by the new smart alarm wireless indoor camera available with the fast protect monitoring plan. With advanced motion detection and vision AI, the smart alarm indoor camera can sense the difference between potential intruders and pets to reduce false alarms. Simply Safe Tech and their 24 seven live guard protection work seamlessly together to keep your whole home safe from break ins, fires, flooding and more. There's a reason over 4 million people trust Simply Safe to keep their home secure. Right now, Blind Plea listeners get a special 20% off any Simply Safe system when you sign up for a free month trial of fast protect monitoring. This special offer is for a limited time only. Visit simply safe.com slash blind plea. That's simply safe.com slash blind plea. There's no safe like Simply Safe. Well, it looks like we just crossed 5 million podcasts in the world. So it is with some humility that I introduce mine, Kelly Corrigan Wonders. Once a week we share heart to hearts with smart good people like Bryan Stevenson, Anna Quinlan, Father Greg Boyle, talking about how we treat each other, how we treat ourselves and how we might do both better. Kelly Corrigan Wonders is a podcast for people who like to laugh while they think and aren't afraid of feelings. Join us for Kelly Corrigan Wonders. How has it felt to be like a mom after so long? It kind of felt like I was never gone in a way, like because she's so, she's my kid, she's my baby, you know. And it was emotional for me because I was like, well, now I get to be mommy again. But at the same time, it was like, okay, well, like I never stopped being mommy. I just wasn't there for a little while. Yeah. Was she like excited to see you or was she just like, whoa, this is crazy? Or like, what was her reaction? Like at first at night, when I that night that I like pretty much woke her up, she was kind of like, I think I know you. But like the next day it was kind of, it wasn't really that big of a deal. But as it as she got more and more used to me now, she's just very, she's like, she's a love bug. Like she'll sit on my lap and she'll, you know, hug me and give me kisses and stuff like that. So yeah, so I think like now that she's recognizing me as mommy, she's way like she's very affectionate towards me. So I were you. Yeah. Are you going to eventually try to gain custody? Yes. That's like a process. But really all I have to do is show that I'm independent and I can take care of her independently. And I guess that's why I'm pushing myself so hard because I want to have a job and I want to be able to save up some money. So that way an apartment, you know, I can I mean, the cost of living here is kind of high. But you know, you can always you can find the right place. And so I'm going to look for the right place and get us a two bedroom and try to, you know, be on my own. And do you feel like on top of all that, like people have expectations of you? Um, yeah, I mean, I think I'm the hardest on myself because everyone else is like, you know, well, not everyone, but my stepmom, my aunt, my sister, they're like, you know, you're doing you're doing really well. You're trying really hard. You're applying to these places. You're you know, you're gung ho about making a resume, filling out applications. You want to do something. It's not like you're just sitting around and you're just playing on your phone. On top of that, like I'm still mom and I'm still doing all this other, you know, I'm trying to, you know, get other things set up for myself. And I mean, I really want to write and I really, you know, and I'm but I was like, I don't have time for that. It's like that's it. That's in my head. You know, I don't have time for that. But as far as pressure, I think that or expectations, I think that I'm I'm my worst critic. And I think I'm my worst like enemy when it comes to that, because I think that, yeah, they expect me to do things, but they also know where I've been. It's different if you like, you know, you just messed up or you're just not doing what you're supposed to be doing and your parents take you in because you don't have no other place to go. And it's like, well, you have two months or you're or you're getting kicked out. It's like, no, take your time because we know where you've just come from. And I don't want to take my time. I want to do it. I want everything that I want. I want it right now. So I don't want to wait. Where have you applied? Like, what are the what are the jobs? It's like the grocery store giant. Aldi's there's like America's Best Value, the little motel hotel thing. There's like a there's a gas station where they need like a clerk and like places like that. Like I've been trying to just to just to go walking distance, you know, or if I do have to ask for a ride, it's not but like 10 minutes in the car. Yeah. So ultimately, in terms of jobs, like, what do you because of course, right now, you're going to get a job that's close and take your time and settle in. But like down the road, are you still feeling like you want to be an advocate or write a book or be a mechanic or like what's on your mind? I'm well, I really, really want to be an advocate and I want to be a writer and my stepmom thinks I should be a public speaker. I don't know about all that. I love to talk about things, but getting out there and actually talking and having people see me like that, that's that's kind of daunting. But I mean, like, I would do it. I would just be really nervous the first few times. But I would love that. Like, that's one of my like that's like a goal. Like I know at first, I was all about diesel mechanics and I really wanted to do that because it's something different and I was so interested in it. But now it's like I feel like I'm kind of tugged more towards being an advocate, being the voice for people talking about things that people don't talk about because people just don't talk about it. They just don't or they make it seem glamorous and put it in movies that, you know, the woman fights back and she wins and there's no repercussions for fighting back or anything like that. Like, it's just like a Jennifer Lopez glamour enough kind of thing. And it's not like that. It's really not. When you're in actual domestic violence relationship, like your boyfriend's not just going to be like, OK, you took self-defense classes and now you're going to like whoop on me. Like, no, they're going to be way worse than that. So and I want and I also want the people who are in those relationships or who have been in those relationships to understand that someone is they're not alone. That or and then they shouldn't feel like they're less than or that they're stupid because that's what I mean. I still kind of kick myself and feel that kind of way. But I just want to make the world more aware of the problem and how it ties into so many things. It's not just it's not black and white at all. It's really not. I know there is a lot of times I could have left or should have left. And looking back on it now, I'm like, well, dang, I wish I had, of course. But I don't know. I was just too ashamed to admit that I had messed up and I messed up in a big way. So I kind of let that drive me to stay. Yeah, shame is like such a powerful emotion. Yeah. Hey, it's me, Sam Bee, and it's no secret I'm pro-choice. Yes, that one, but also others because I'm not just pro-choice. I'm pro-choices, those crazy life altering decisions that shift our life path and bring us to where we are today. My next choice, starting this new podcast with Lemonada Media called Choice Words, where I interview people I admire about the biggest decisions they've made in their lives. Choice Words is out now wherever you get your podcasts. Hey, listeners. Are you looking to update your wardrobe with items that actually make life suck less? We're here to help. We've got brand new Lemonada merchandise from Add to Cart, In the Bubble, V Interesting, Braced by Ricky, and more at the Lemonada Media online store. From stylish sweatshirts to eco-friendly water bottles, we've worked hard to curate a comprehensive line of actually cool merchandise that will fit seamlessly into your everyday life. Show off your favorite Lemonada podcast or your favorite Lemon logo in style with t-shirts, tumblers, hats, mugs, and more. Head to our merch store at lemonadamedia.com slash shop to pick up your Lemonada merch today. I wanted to ask, have you listened to the podcast at all? Why or why not? I listened to the trailer and I heard my voice on the 911 call and I freaked out and I had a whole cup of bar. I just don't know if I'm ready to do it, honestly. To hear my own voice and to hear my story like that, I think it'll make it too real. I really do. Right now, I just can't. I've desensitized myself so much that if I sit here and I listen to my story and I listen to all the things that I went through and listen to my parents and my aunts and my sister, I think I'll lose my mind. I really do. I don't want to do that right now. Maybe when I'm established and I can have a breakdown for just a second and not feel like I've completely spiraled out of control, then maybe I will. Yeah, that makes sense. Has anyone else in your friends or family listened and given you feedback? Yeah, I've had one friend who actually was in Shelby County jail with me. She said she listened to it and she really enjoyed it. She said, it's crazy to hear you on there because she doesn't know me as this victim kind of person because I've never been that way. She said that she really enjoyed listening to it as far as hearing my story because I don't really break it down for anybody. I just tell people I had a really mean boyfriend and I got tired of him being mean and that's what I tell people. Yeah, are you glad that you participated or how do you feel about it at this point? Oh yeah. I think it was therapeutic for me and I think that it helped me cope while I was locked up and it gave me something to do and to strive for and it also opened up opportunities for me to do what I also want to do, which is advocate and write and I guess public speak. I don't know about that but I mean eventually yeah, I would like to do that. I just have to take a confidence boost pill or something. There's got to be something, take some classes on self-confidence I guess. I don't know. Yeah, I'm really glad and I got to meet you. That's the cherry on top. I can't wait to come to Baltimore as soon as I'm allowed to travel again. Yeah. As soon as I push out this damn baby. One other thing I want to ask you is in the podcast we talk about breaking cycles and the importance of breaking generational cycles of violence and trauma. Do you feel like you're doing that in any way now? The real problem that I know my dad and me and my sister are problem and my mom, there was addiction and I think that that had a lot to do with decisions that I made and decisions that people let me make, if that makes sense. But again, I think that I'm so far away from that mentality now. My whole mentality is different and a has a lot to do with that. I think my mentality is just so much different now because of the things that I've seen and the things that led me to this point. I think I would just... Breaking that curse, I think that I've already done that because I don't even have it in me to put through even a little bit of what I went through when I was her age. The older she gets, the more I'm going to just be like, no, that's just not how this works. How do you look back on the person you were before when maybe alcoholism was present in your life versus now who you are with a totally different mindset? Well, I just think about the things that I let happen because of alcohol. I think about all the things that my mom went through, my sister's gone through because of alcohol. It motivates me to be in the opposite direction. Some people take the bad and make it their purpose for good and some people take the bad and make it an excuse and go ahead and just get into the bad as well. I think that I'm just on the other side where I'm like, I don't want anything to do with it. I don't. Yeah. Yeah. That makes a lot of sense. I was also thinking about how we've talked a lot about love and how you love love, which I also identify with. What kind of love do you want going forward in the future? I haven't even thought about that. I guess I just want someone to love me and love for who she is because she's a lot of work and she's like if she's not at school, she's full time. She's full time job. I guess if they love her and they love me and they accept her and they accept me, then that's good enough for me for real. Now that I'm out, my mindset's so different that it's like I'm just like whatever. I don't know. I still love love and I think love is the greatest thing that there ever was. At the same time, I just haven't put time into love. I haven't put time into that part of it. I just want to be independent and be a good person and then I'll worry about love. That's so cool to hear you say because I think a lot of us just get caught up in that and then that comes first and then everything else second and then it causes chaos in your life. Yeah, because that's exactly what I did the first time and I don't want to do that again. My family calls it hormones, but it was not hormones. It was love. I was in love with him. They just don't understand love like I do. Nobody does except for you if you're in it. Devon has a totally different idea about romantic love after all she's been through. She's focused on making up the years she's lost and ready to be the mom she has wanted to be for the five years she's been away. So yeah. So that's it. I can't believe like our podcast is over, but now I get to talk to you like a normal person. Yeah, absolutely. So that's exciting and I'll be asking you for mom advice. Oh yeah, yeah, I'm excited. I'll be like, how do I change a diaper though? Like what do I do? One more thing before I go. As we were finishing production on this podcast, we found out about several other cases of women who were arrested in Alabama for killing their alleged abusers. One woman was charged with murder and her case is ongoing. Two other women took plea deals for manslaughter. The injustice doesn't end with Devon and it's a reminder that when we hear stories like this, the reality is often more complicated. It's a reminder to pay attention to anyone who might be struggling with domestic abuse. The more we can keep an eye out for people in our own lives in unhealthy relationships, the more we can prevent tragedies like this from happening. Domestic abuse thrives in the dark and I believe sunlight is the best disinfectant. If you or someone you know is experiencing domestic abuse, use a safe computer and contact the National Domestic Violence Hotline at thehotline.org or call 1-800-799-7233. There's more Blind Plea with Lemonada Premium. Subscribers get exclusive access to bonus content like tape from one of my phone calls with John's dad, Henry. Subscribe now in Apple podcasts. Blind Plea is a production of Lemonada Media. I'm your host, Liz Flock. This episode was produced by Tony Williams. Hannah Boomershine and Rachel Pilgrim are also our producers. Kristen Lepore is our senior producer. Story editing by Martina Abraham's Alunga. Mix, music, and sound design by Andy Christen's daughter with additional mixing and engineering from Ivan Kuraev. Naomi Barr is our fact checker. Jaitla Everett is our production intern. Jackie Danziger is our vice president of narrative content. Executive producers are Stephanie Whittle's Wax, Jessica Cordova-Cramer, Evoke Media, and Sabrina Miraj Naim and myself, Liz Flock. This series was co-created with Evoke Media and presented by Marguerite Casey Foundation. Help others find our show by leaving us a rating and writing a review. Follow me at Liz Flock and for more stories of women and self-defense, check out my book, The Furies from Harper Books, available for pre-order now. Find Lemonada at Lemonada Media across all social platforms and follow Blind Plee wherever you get your podcasts or listen ad free on Amazon Music with your Prime membership. Thanks so much for listening. Join me, V Sphere, your podcasting bestie on V Interesting from Lemonada Media. We'll tackle today's chaotic world with optimism as we go beyond the headlines. From politics to human rights to business and tech, we'll break down what you need to know to become the most interesting person in any room. Like I say on the show, let's be smart together. Listen to V Interesting every Friday on Amazon Music, Apple, Spotify, or wherever you get your podcasts. I'm World Cup champion, Megan Klingenberg. Wondering who you should root for at the FIFA Women's World Cup? I'm hosting a new podcast, My New Favorite FupaLista, where I will introduce you to soccer's brightest stars and the causes they are championing. From the 22 year old American phenom speaking out about student athlete mental health, I try to just like approach everything with like, you don't know what someone's going through to the U.S. defender who travels to tournaments with her young son. Am I ever going to be able to run for five minutes straight? Check out My New Favorite FupaLista wherever you listen to podcasts."}, "podcast_summary": "Devin, who was released from prison, is working hard to get her life back on track. She has been applying for jobs and wants to become fully independent. She also plans to gain custody of her child and be a responsible mother. Devin is focused on breaking the generational cycle of violence and trauma and wants to be an advocate and writer. She believes in the power of love but wants to prioritize her independence and personal growth before pursuing romantic relationships. Devin reflects on the changes she has made since her past experiences with alcoholism and is determined to lead a better life. She also discusses the challenges of reentry after being in prison and the importance of mental health. While she hasn't listened to the podcast about her story, she finds participating in it therapeutic and believes it can help raise awareness about domestic abuse. The podcast provides an update on other cases of women who have committed crimes against their abusers, emphasizing the need for vigilance in identifying and addressing domestic abuse.", "podcast_guest": {"name": "Kelly Corrigan", "org": "", "title": "", "summary": "Kelly Corrigan (born August 16, 1967) is an American writer. She is a graduate of the University of Richmond and received a Masters in Literature from San Francisco State University. She is the host of Exactly, a 2017 series where top thinkers take on big ideas. Season One's guests included Margaret Atwood, Walter Isaacson, BJ Novak, Jason Segel and John Cleese. She is also the host of Kelly Corrigan Wonders, a Public Radio series, originating from WHYY in Philadelphia, that ponders “the big questions” with guests like Melinda Gates. She is the host in the interview show Tell Me More With Kelly Corrigan which premiered in October, 2020 on PBS and has had, as of May 1, 2021, three episodes with activist Bryan Stevenson (Ep. 1), entertainer James Corden (Ep. 2) and actress Jennifer Garner (Ep. 3)."}, "podcast_highlights": "Podcast Highlights from \"Add to Cart\" with Sujan Pak and Kulap Vilaysack: \n\n- Sujan and Kulap discuss the things they buy and what it says about them (0:40)\n- They talk about beauty products, health trends, and personal philosophies (1:05)\n- The podcast explores the concept of worth and investments (1:30)\n- New episodes are released on Tuesdays (1:48)\n\nPodcast Highlights from \"Blind Plea\" with Liz Flock: \n\n- Liz interviews Devin, who was released from prison and talks about her readjustment to life (2:36)\n- Devin discusses the challenges of getting set up after leaving prison, including finding new IDs and applying for jobs (3:38)\n- She shares her goal of becoming fully independent and rebuilding her life (5:18)\n- Devin talks about the importance of mental health and seeking therapy (7:23)\n- She discusses the paperwork and documentation needed after release, such as getting a Social Security card, a driver's license, and Medicaid (9:33)\n- Devin reflects on the pressure and expectations she feels as she works towards independence (11:13)\n- She talks about wanting to become an advocate, writer, and public speaker to raise awareness about domestic violence (12:57)\n- Devin reflects on breaking generational cycles of addiction and trauma (16:00)\n- She discusses her changed perspective on love and prioritizing independence and motherhood (18:04)\n\nNote: The timestamps are approximate and may vary slightly depending on the podcast platform or listening device."}